app/Helpers/custom_helper.php

SELECT *
FROM `user`
WHERE `id_user` = '2'
---
function userLogin () {
    $db = \Config\Database::connect();
    return $db->table('user')->where('id_user', session('id_user'))->get()->getRow();