app/Controllers/Auth.php

    public function loginProcess()
{
    $post = $this->request->getPost();
    $query = $this->db->table('user')->getWhere(['email_user' => $post['email_user']]);
---
SELECT *
FROM `user`
WHERE `email_user` = 'admin@cotecna.com'