app/Controllers/Inspection.php

SELECT *
FROM `containers`
WHERE `id_container` = '6'
AND `containers`.`deleted_at` IS NULL
 LIMIT 1
---
    public function perform($id = null)
{
    // Ensure $id is not null and is numeric
    if ($id === null || !is_numeric($id)) {
        return redirect()->back()->with('error', 'Invalid inspection ID');
    }

    // Find the inspection using find() method
    $inspection = $this->model->find($id);

    if (!$inspection) {
        return redirect()->back()->with('error', 'Inspection not found');
    }

    // Get container details safely using a query builder approach
    $container = (object) $this->containerModel->where('id_container', $inspection->container_id)->first();