app/Models/InspectionModel.php

SELECT `inspections`.*, `containers`.`container_number`, `user`.`name_user` as `surveyor_name`
FROM `inspections`
JOIN `containers` ON `containers`.`id_container` = `inspections`.`container_id`
JOIN `user` ON `user`.`id_user` = `inspections`.`surveyor_id`
---
    public function getAllInspections()
    {
        return $this->select('inspections.*, containers.container_number, user.name_user as surveyor_name')
                    ->join('containers', 'containers.id_container = inspections.container_id')
                    ->join('user', 'user.id_user = inspections.surveyor_id')
                    ->findAll();